In [1]:
import pandas as pd

In [4]:
data = {
'name': ['John', 'Jane', 'Sam', 'Sara', 'Alex', 'David', 'Emily', 'Frank',
'Grace', 'Hannah',
'Ivy', 'Jack', 'Luke', 'Mia', 'Nina', 'Oliver', 'Paul', 'Quincy',
'Rachel', 'Sophia',
'Tom', 'Ursula', 'Victor', 'Walter', 'Xander', 'Yara'],
'department': ['HR', 'IT', 'HR', 'Sales', 'HR', 'IT', 'Sales', 'Sales', 'HR',
'IT',
'Sales', 'HR', 'Sales', 'IT', 'HR', 'Sales', 'IT', 'Sales', 'HR',
'Sales',
'IT', 'HR', 'Sales', 'HR', 'IT', 'Sales'],
'salary': [5000, 7000, 6000, 4500, 5500, 8000, 7000, 6000, 5000, 4000,
6500, 6000, 5500, 7500, 4500, 7000, 8000, 6500, 5500, 6500,
5000, 7500, 6000, 5500, 7000, 6500]
}

In [5]:
df=pd.DataFrame(data)

# Using list comprehension, find names of employees who earn more than 7000

In [238]:
d= [df['name'][x] for x in range(len(df['salary'])) if df['salary'] [x] >7000]

print('the name of the employees who earn >7000\n',d)

the name of the employees who earn >7000
 ['David', 'Mia', 'Paul', 'Ursula']

In [239]:
#print('the name of the employees who earn >7000\n',d)

# Find employees from 'IT' department using .loc

In [240]:
a=df[df['department']=='IT']
print(a)

      name department  salary
1     Jane         IT    7000
5    David         IT    8000
9   Hannah         IT    4000
13     Mia         IT    7500
16    Paul         IT    8000
20     Tom         IT    5000
24  Xander         IT    7000

In [241]:
b=df.loc[df['department']=='IT','name']
print(b)

1       Jane
5      David
9     Hannah
13       Mia
16      Paul
20       Tom
24    Xander
Name: name, dtype: object

# Calculate total salary by department and sort by total salary in descending order

In [253]:
grouped_salaries=df.groupby('department')['salary'].sum().sort_values(ascending=False)
grouped_salaries

department
Sales    62000
HR       50500
IT       46500
Name: salary, dtype: int64

# Find out top 5 employee who are highly paid

In [259]:
df.sort_values(by= 'salary',ascending=False).head(5).reset_index(drop=True)

     name department  salary
0   David         IT    8000
1    Paul         IT    8000
2     Mia         IT    7500
3  Ursula         HR    7500
4    Jane         IT    7000

In [63]:
students = [
{"id": 1, "name": "Alice", "age": 20, "marks": 85},
{"id": 2, "name": "Bob", "age": 22, "marks": 75},
{"id": 3, "name": "Charlie", "age": 23, "marks": 45},
{"id": 4, "name": "David", "age": 21, "marks": 65},
{"id": 5, "name": "Eva", "age": 24, "marks": 90},
{"id": 6, "name": "Frank", "age": 25, "marks": 55},
{"id": 7, "name": "Grace", "age": 22, "marks": 72},
{"id": 8, "name": "Henry", "age": 23, "marks": 80},
{"id": 9, "name": "Ivy", "age": 21, "marks": 65},
{"id": 10, "name": "Jack", "age": 24, "marks": 95},
{"id": 11, "name": "Kenny", "age": 26, "marks": 50},
{"id": 12, "name": "Lily", "age": 25, "marks": 60},
{"id": 13, "name": "Mike", "age": 27, "marks": 48},
{"id": 14, "name": "Nina", "age": 28, "marks": 92},
{"id": 15, "name": "Oscar", "age": 29, "marks": 84},
{"id": 16, "name": "Paul", "age": 30, "marks": 79},
{"id": 17, "name": "Quinn", "age": 31, "marks": 71},
{"id": 18, "name": "Rachel", "age": 32, "marks": 66},
{"id": 19, "name": "Steve", "age": 33, "marks": 56},
{"id": 20, "name": "Tina", "age": 34, "marks": 60}
]

In [64]:
import pandas as pd 
st=pd.DataFrame(students).set_index('id')

In [65]:
st.head()

       name  age  marks
id
1     Alice   20     85
2       Bob   22     75
3   Charlie   23     45
4     David   21     65
5       Eva   24     90

In [92]:
def s(a):
    for x in a.index:
        if (a.loc[x,"marks"])>80:
            a.loc[x,'cat']='excelent'
        #print(x)
        elif ((a.loc[x,'marks']>=50)):
        #print(x)
            a.loc[x,'cat']='good'
        elif (a.loc[x,'marks'])<50:
        #print(x)
            a.loc[x,'cat']="Needs Improvement"

In [93]:
s(st)
print(st)

       name  age  marks                cat
id
1     Alice   20     85           excelent
2       Bob   22     75               good
3   Charlie   23     45  Needs Improvement
4     David   21     65               good
5       Eva   24     90           excelent
6     Frank   25     55               good
7     Grace   22     72               good
8     Henry   23     80               good
9       Ivy   21     65               good
10     Jack   24     95           excelent
11    Kenny   26     50               good
12     Lily   25     60               good
13     Mike   27     48  Needs Improvement
14     Nina   28     92           excelent
15    Oscar   29     84           excelent
16     Paul   30     79               good
17    Quinn   31     71               good
18   Rachel   32     66               good
19    Steve   33     56               good
20     Tina   34     60               good

In [94]:

for x in a.index:
    if (a.loc[x,"marks"])>80:
        a.loc[x,'cat']='excelent'
        #print(x)
    elif ((a.loc[x,'marks']>=50)):
        #print(x)
        a.loc[x,'cat']='good'
    elif (a.loc[x,'marks'])<50:
        #print(x)
        a.loc[x,'cat']="Needs Improvement"
        
a

       name  age  marks                cat
id
1     Alice   20     85           excelent
2       Bob   22     75               good
3   Charlie   23     45  Needs Improvement
4     David   21     65               good
5       Eva   24     90           excelent
6     Frank   25     55               good
7     Grace   22     72               good
8     Henry   23     80               good
9       Ivy   21     65               good
10     Jack   24     95           excelent
11    Kenny   26     50               good
12     Lily   25     60               good
13     Mike   27     48  Needs Improvement
14     Nina   28     92           excelent
15    Oscar   29     84           excelent
16     Paul   30     79               good
17    Quinn   31     71               good
18   Rachel   32     66               good
19    Steve   33     56               good
20     Tina   34     60               good

In [26]:
st.index

Int64Index([1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19,
            20],
           dtype='int64', name='id')

In [78]:
a.loc[5,'cat']

'good'

In [70]:
x

20

In [32]:
a.loc[2]['marks']

75

In [82]:
a.loc[2]["cat"]

'good'

In [39]:
a=st
for x in a.index:
    if (a.loc[x,'marks' > 80):
        a['cet']=('excelent')
    elif ((a.loc[x,'marks')>=50 and (a.loc[x]['marks'])<=80):
        a['cet']=('Good') 
    elif (a.loc[x]['marks']<50):
        a['cet']=('NI')
print(a)

       name  age  marks   cet
id
1     Alice   20     85  Good
2       Bob   22     75  Good
3   Charlie   23     45  Good
4     David   21     65  Good
5       Eva   24     90  Good
6     Frank   25     55  Good
7     Grace   22     72  Good
8     Henry   23     80  Good
9       Ivy   21     65  Good
10     Jack   24     95  Good
11    Kenny   26     50  Good
12     Lily   25     60  Good
13     Mike   27     48  Good
14     Nina   28     92  Good
15    Oscar   29     84  Good
16     Paul   30     79  Good
17    Quinn   31     71  Good
18   Rachel   32     66  Good
19    Steve   33     56  Good
20     Tina   34     60  Good

In [150]:
columns=['name','department','age','salary','joining_date','created_date','last_updated_timestamp','rating','experience_years','bonus','project_count']
d=pd.read_csv("E:\DE\employee_data.csv",sep='~',usecols=columns)
#.set_index('id')

In [152]:
d

,name,age,salary,joining_date,department,rating,experience_years,bonus,project_count,created_date,last_updated_timestamp
0,Alice,50.0,118925.875299,2023-01-01,Finance,2.995399,26,5000.0,7,2023-01-01,2023-01-01 08:00:00
1,Bob,0.0,99891.929595,2023-01-08,IT,1.692691,13,5000.0,6,2023-01-02,2023-01-01 20:00:00
2,Charlie,0.0,0.000000,2023-01-15,Sales,4.389090,19,5000.0,9,2023-01-03,2023-01-02 08:00:00
3,Diana,31.0,101317.014661,2023-01-22,Marketing,3.179797,21,0.0,8,2023-01-04,2023-01-02 20:00:00
4,Ethan,52.0,119926.309095,2023-01-29,Marketing,4.958121,18,0.0,9,2023-01-05,2023-01-03 08:00:00
5,Fiona,33.0,45995.785884,2023-02-05,IT,3.749584,7,10000.0,5,2023-01-06,2023-01-03 20:00:00
6,George,58.0,0.000000,2023-02-12,Sales,2.431404,37,10000.0,5,2023-01-07,2023-01-04 08:00:00
7,Hannah,54.0,62316.571565,2023-02-19,Finance,3.288137,37,10000.0,0,1900-01-01,2023-01-04 20:00:00
8,Ian,21.0,48955.605573,2023-02-26,Finance,1.840792,22,5000.0,9,2023-01-09,2023-01-05 08:00:00
9,Julia,0.0,111165.739614,2023-03-05,HR,2.361121,6,10000.0,5,2023-01-10,2023-01-05 20:00:00
10,Kevin,51.0,50260.076467,2023-03-12,Finance,4.870724,30,10000.0,4,2023-01-11,2023-01-06 08:00:00
11,Laura,33.0,80335.671989,2023-03-19,Sales,1.705210,38,5000.0,4,2023-01-12,2023-01-06 20:00:00
12,Michael,58.0,111361.778563,1900-01-01,Sales,3.421635,34,0.0,7,1900-01-01,1900-01-01 00:00:00
13,Nina,27.0,0.000000,2023-04-02,IT,3.582679,22,10000.0,6,2023-01-14,2023-01-07 20:00:00
14,Oliver,0.0,65251.109842,2023-04-09,HR,1.140984,12,0.0,7,2023-01-15,1900-01-01 00:00:00
15,Paula,0.0,77309.942757,2023-04-16,Finance,4.540364,35,0.0,5,2023-01-16,2023-01-08 20:00:00
16,Quincy,36.0,91754.663139,2023-04-23,IT,4.859996,0,10000.0,2,2023-01-17,2023-01-09 08:00:00
17,Rachel,21.0,44930.138357,2023-04-30,Sales,2.627156,39,5000.0,9,2023-01-18,2023-01-09 20:00:00
18,Steve,51.0,75899.002743,2023-05-07,HR,1.736867,3,0.0,3,2023-01-19,2023-01-10 08:00:00
19,Tina,18.0,93062.352696,2023-05-14,IT,1.736889,10,10000.0,5,2023-01-20,2023-01-10 20:00:00
20,Uma,20.0,87046.594589,2023-05-21,IT,2.712561,28,5000.0,8,2023-01-21,2023-01-11 08:00:00
21,Victor,54.0,0.000000,2023-05-28,Finance,3.308732,0,5000.0,4,2023-01-22,2023-01-11 20:00:00
22,Wendy,42.0,0.000000,2023-06-04,Sales,3.768433,38,10000.0,4,2023-01-23,2023-01-12 08:00:00
23,Xander,0.0,0.000000,1900-01-01,IT,4.343362,0,0.0,7,2023-01-24,2023-01-12 20:00:00
24,Yara,55.0,56610.867092,2023-06-18,Sales,2.999929,28,5000.0,4,2023-01-25,2023-01-13 08:00:00
25,Zane,31.0,44148.701233,2023-06-25,Finance,4.824813,34,10000.0,1,2023-01-26,2023-01-13 20:00:00
26,Abigail,33.0,111992.878403,2023-07-02,Marketing,3.008952,15,0.0,2,2023-01-27,2023-01-14 08:00:00
27,Ben,22.0,67169.417715,2023-07-09,HR,4.545915,18,0.0,0,2023-01-28,1900-01-01 00:00:00
28,Catherine,51.0,44479.513918,2023-07-16,Finance,2.649537,21,10000.0,4,2023-01-29,2023-01-15 08:00:00
29,David,25.0,0.000000,2023-07-23,IT,2.186011,24,0.0,9,2023-01-30,2023-01-15 20:00:00
30,Ella,0.0,97216.827550,1900-01-01,Marketing,1.395891,24,5000.0,1,2023-01-31,2023-01-16 08:00:00
31,Frank,41.0,49922.680232,2023-08-06,Sales,3.297572,38,5000.0,1,2023-02-01,2023-01-16 20:00:00
32,Grace,43.0,62274.116032,2023-08-13,Sales,1.478369,37,0.0,3,2023-02-02,2023-01-17 08:00:00
33,Henry,33.0,95822.980917,2023-08-20,IT,4.350482,29,5000.0,9,2023-02-03,2023-01-17 20:00:00
34,Ivy,28.0,38393.420341,2023-08-27,Sales,2.472457,9,0.0,1,2023-02-04,2023-01-18 08:00:00
35,Jack,43.0,96091.071087,1900-01-01,Sales,4.236410,29,5000.0,4,2023-02-05,2023-01-18 20:00:00
36,Katie,35.0,47760.716837,1900-01-01,IT,3.197777,34,5000.0,8,2023-02-06,2023-01-19 08:00:00
37,Liam,0.0,83472.587685,2023-09-17,IT,1.409333,0,0.0,2,2023-02-07,2023-01-19 20:00:00
38,Mona,41.0,0.000000,2023-09-24,IT,4.383594,38,5000.0,9,2023-02-08,1900-01-01 00:00:00
39,Nathan,43.0,58448.903037,2023-10-01,Marketing,2.303388,30,0.0,1,2023-02-09,1900-01-01 00:00:00
40,Olivia,0.0,72554.368074,2023-10-08,Sales,2.717866,16,0.0,1,1900-01-01,2023-01-21 08:00:00
41,Peter,19.0,45205.666301,2023-10-15,IT,3.081404,34,0.0,0,2023-02-11,2023-01-21 20:00:00
42,Queen,0.0,48977.376884,2023-10-22,Finance,4.054101,9,5000.0,9,2023-02-12,2023-01-22 08:00:00
43,Robert,50.0,110025.081027,2023-10-29,Marketing,3.575024,27,10000.0,9,1900-01-01,2023-01-22 20:00:00
44,Sophia,44.0,72967.071602,2023-11-05,Finance,1.312079,35,5000.0,5,2023-02-14,2023-01-23 08:00:00
45,Thomas,36.0,73561.119189,2023-11-12,Marketing,4.545694,12,5000.0,0,1900-01-01,2023-01-23 20:00:00
46,Ursula,18.0,30511.798672,2023-11-19,Sales,1.324086,36,10000.0,1,2023-02-16,2023-01-24 08:00:00
47,Vera,31.0,92230.172676,2023-11-26,Sales,3.549378,27,5000.0,8,2023-02-17,2023-01-24 20:00:00
48,William,59.0,0.000000,2023-12-03,Sales,2.148778,31,10000.0,8,2023-02-18,2023-01-25 08:00:00
49,Zara,26.0,0.000000,2023-12-10,IT,3.369178,14,0.0,9,2023-02-19,2023-01-25 20:00:00

In [156]:
dtypes1 = {
   
    'name':str,
    'age': int ,
    'salary': float,
    'department':str,
    'rating': float,
    'experience_years':int,
    'bonus': float,
    'project_count':int, 
    
}

In [157]:
d=d.astype(dtypes1)

In [155]:
d['joining_date']=pd.to_datetime(d['joining_date'])
d['created_date']=pd.to_datetime(d['created_date'])
d['last_updated_timestamp']=pd.to_datetime(d['last_updated_timestamp'])

In [151]:
d['age']=d['age'].fillna(0)
d['salary']=d['salary'].fillna(0)
d['joining_date']=d['joining_date'].fillna('1900-01-01')
d['bonus']=d['bonus'].fillna(0)
d['created_date']=d['created_date'].fillna('1900-01-01')
d['last_updated_timestamp']=d['last_updated_timestamp'].fillna('1900-01-01 00:00:00')

In [158]:
d.dtypes

name                              object
age                                int32
salary                           float64
joining_date              datetime64[ns]
department                        object
rating                           float64
experience_years                   int32
bonus                            float64
project_count                      int32
created_date              datetime64[ns]
last_updated_timestamp    datetime64[ns]
dtype: object

In [178]:
pip install sqlalchemy

Requirement already satisfied: sqlalchemy in c:\users\lenovo\anaconda3\lib\site-packages (1.4.27)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\lenovo\anaconda3\lib\site-packages (from sqlalchemy) (3.0.0)
Note: you may need to restart the kernel to use updated packages.

In [169]:
pip install psycopg2

Collecting psycopg2
  Downloading psycopg2-2.9.10-cp39-cp39-win_amd64.whl (1.2 MB)
     ---------------------------------------- 1.2/1.2 MB 2.0 MB/s eta 0:00:00
Installing collected packages: psycopg2
Successfully installed psycopg2-2.9.10
Note: you may need to restart the kernel to use updated packages.

In [165]:
import sqlalchemy
sqlalchemy.__version__

'1.4.27'

In [167]:
from sqlalchemy import create_engine

In [170]:
# Note: 'postgresql://username:password@localhost:5432/your_database'

engine_string ='postgresql://postgres:admin@localhost:5432/monjur'
engine = create_engine(engine_string)

In [175]:
d.to_sql('employee_data', engine, if_exists='replace', index=True)

50

In [99]:
d.isna().sum()

name                      0
age                       0
salary                    0
joining_date              0
department                0
rating                    0
experience_years          0
bonus                     0
project_count             0
created_date              0
last_updated_timestamp    0
dtype: int64

In [249]:
grouped_salaries.sort_values( ascending=False)

department
Sales    62000
HR       50500
IT       46500
Name: salary, dtype: int64

In [248]:
grouped_salaries

department
HR       50500
IT       46500
Sales    62000
Name: salary, dtype: int64

In [252]:
grouped_salariekks

department
Sales    62000
HR       50500
IT       46500
Name: salary, dtype: int64

In [1]:
data = {
    'Name': ['Alice', 'Bob'],
    'Age': [25, 30]
}

df = pd.DataFrame(data)
new_row = pd.DataFrame([['Charlie', 35]], columns=['Name', 'Age'])
df = df.append(new_row, ignore_index=True)
print("DataFrame After Adding a Row with append():\n", df)

NameError: name 'pd' is not defined

In [191]:
new_row = pd.DataFrame([['Charlie', 35]], columns=['Name', 'Age'])

In [196]:
pd.concat([df,new_row], ignore_index=True)

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
3  Charlie   35

In [117]:
data = {
    'Start': ['2024-01-01 10:00', '2024-01-02 15:30', '2024-01-03 08:45'],
    'End': ['2024-01-01 12:00', '2024-01-02 17:00', '2024-01-03 09:30']
}

gg = pd.DataFrame(data)

In [ ]:
df['Start'] = pd.to_datetime(df['Start'])
df['End'] = pd.to_datetime(df['End'])
df['Duration'] = df['End'] - df['Start']
print("DataFrame with Duration:\n", df)

In [119]:
pd.to_datetime(gg['Start'])

0   2024-01-01 10:00:00
1   2024-01-02 15:30:00
2   2024-01-03 08:45:00
Name: Start, dtype: datetime64[ns]

In [147]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'Los Angeles', 'Chicago']
}
df = pd.DataFrame(data)

In [148]:
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [152]:
additional_data = {
    'Salary': [70000, 80000, 90000],
    'Gender': ['F', 'M', 'M']
}

In [155]:
df[['Shhhalary','gender']]=[[7000,'f'],[455,'r'],[4546,'g']]

In [168]:
df.sort_values(by=['slry','yr'],ascending=True)
#df.sort_values(by='Age')

      Name  yr         City  Salary gender Gender  slry
1      Bob  30  Los Angeles   80000      r      M   455
2  Charlie  35      Chicago   90000      g      M  4546
0    Alice  25     New York   70000      f      F  7000

In [153]:
df = df.assign(**additional_data)

In [162]:
df=df.rename(columns={'Shhhalary' :'slry','Age':'yr'})

In [163]:
df

      Name  yr         City  Salary gender Gender  slry
0    Alice  25     New York   70000      f      F  7000
1      Bob  30  Los Angeles   80000      r      M   455
2  Charlie  35      Chicago   90000      g      M  4546

In [85]:
s = pd.Series()
print (s)

Series([], dtype: float64)

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_20872\3654280708.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  s = pd.Series()

In [86]:
data = [10, 20, 30, 40]

In [88]:
pd.Series(data)

0    10
1    20
2    30
3    40
dtype: int64

In [101]:
data

[100, 200, 300, 400, 500]

In [117]:
s=pd.DataFrame(data)

In [97]:
data = [100, 200, 300, 400, 500]
index = ['a', 'b', 'c', 'd', 'e']
series = pd.Series(data, index=index)

In [98]:
series

a    100
b    200
c    300
d    400
e    500
dtype: int64

In [100]:
series['a']

100

In [114]:
series_from_dict.isna()

a    False
b     True
c    False
d    False
dtype: bool

In [105]:
series = pd.Series([1, 2, None, 4, None])

missing = series.isna()
print("Missing values:\n", missing)

Missing values:
 0    False
1    False
2     True
3    False
4     True
dtype: bool

In [126]:
columns

['name', 'department', 'salary']

In [132]:
data['name'][2]

'Sam'

In [197]:
data = {
    'Name': ['Alice', 'Bob'],
    'Age': [25, 30]
}

df = pd.DataFrame(data)

In [ ]:
new_row = pd.DataFrame([['Charlie', 35]], columns=['Name', 'Age'])
df = df.append(new_row, ignore_index=True)
print("DataFrame After Adding a Row with append():\n", df)

In [199]:
df = pd.DataFrame({
    'student': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'grade': [85, 92, 85, 90, 75]
})

df

   student  grade
0    Alice     85
1      Bob     92
2  Charlie     85
3    David     90
4      Eva     75

In [210]:
filtered_df = df[df['grade'].isin([85])]

In [211]:
filtered_df

   student  grade
0    Alice     85
2  Charlie     85

In [213]:
df = df.astype({'student': str, 'grade': int})

In [217]:
dtype(df['student'])

NameError: name 'dtype' is not defined

In [233]:

df = pd.DataFrame({
    'A': [1, 2, 3, 4, 5],
    'B': [10, 20, 30, 2, 50]
})
df

   A   B
0  1  10
1  2  20
2  3  30
3  4   2
4  5  50

In [234]:
result = df.where(df > 3)
print(result)

     A     B
0  NaN  10.0
1  NaN  20.0
2  NaN  30.0
3  4.0   NaN
4  5.0  50.0

In [49]:
f = pd.DataFrame({
    'name': ['Alice', 'Bob', 'Charlie', 'David'],
    'age': ['25', '30',NaN, '40'],  
    'score': [85.5, 92.0, 88.5, 95.0]  
})


f = f.astype({'age': int, 'score': int})

NameError: name 'NaN' is not defined